export default function Description() {
  return (
    <>
      <h2 className="border-b-2 border-gray-300 p-2 font-bold  text-slate-500">
        توضیحات
      </h2>
      <p className="p-2 leading-7">
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده
        از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و
        سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای
        متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه
        درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با
        نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان
        خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید
        داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان
        رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات
        پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد. مشاوران
        دوطرفه به خریدار و فروشنده مشاوره می‌دهند. یک مشاور املاک وظیفه دارد که
        با صداقت به هر دو طرف معامله مشاوره و راهنمایی درستی بدهد. مشاوران
        دوطرفه باید از هر دو طرف چه فروشنده و چه خریدار بخواهند که یک قرارداد
        نمایندگی دوطرفه را امضا کنند. قوانین و مقررات خاصی برای مشاوران دوطرفه
        وجود دارد، این دست از مشاوران نسبت به دو دسته قبل کارشان سخت‌تر و
        پیچیده‌تر است.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ
        و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در
        ستون و سطرآنچنان که لازم است.
      </p>
    </>
  );
}
