import Title from "@/components/modules/title/Title";
import Features from "@/components/templates/features/Features";

export default function features({ data }) {
  return (
    <div className="m-14 leading-10">
      <Title text="راهی سریع برای خانه‌دار شدن" />
      <section>
        در اینجا بین صدها هزار آگهی ثبت‌شده جست‌وجو کنید، به سرعت ملک مورد
        نظرتون رو پیدا کنید و برای انجام معامله‌ای مطمئن، با مشاورین املاک معتمد
        و متخصص شهرتون در ارتباط باشید. در اینجا بین صدها هزار آگهی ثبت‌شده
        جست‌وجو کنید، به سرعت ملک مورد نظرتون رو پیدا کنید و برای انجام
        معامله‌ای مطمئن، با مشاورین املاک معتمد و متخصص شهرتون در ارتباط باشید.
        در اینجا بین صدها هزار آگهی ثبت‌شده جست‌وجو کنید، به سرعت ملک مورد
        نظرتون رو پیدا کنید و برای انجام معامله‌ای مطمئن، با مشاورین املاک معتمد
        و متخصص شهرتون در ارتباط باشید. در اینجا بین صدها هزار آگهی ثبت‌شده
        جست‌وجو کنید، به سرعت ملک مورد نظرتون رو پیدا کنید و برای انجام
        معامله‌ای مطمئن، با مشاورین املاک معتمد و متخصص شهرتون در ارتباط باشید.
      </section>
      <Title text="مطمئن" />
      <div>
        یکی از بزرگترین چالش‌های بازار املاک در ایران، عدم وجود فضای قابل
        اطمینان برای همکاری بین دفاتر املاک هست. 2نبش تلاش می‌کنه تا این شبکه
        همکاری رو بین مشاورین ایجاد کنه. فقط مشاورین املاکی رو که از کیفیت و
        سابقه خوبی برخوردار هستند به شبکه اضافه می‌کنه و با استفاده از ابزارهایی
        که در اختیار داره، فضای مطمئنی رو برای همکاری ایجاد می‌کنه یکی از
        بزرگترین چالش‌های بازار املاک در ایران، عدم وجود فضای قابل اطمینان برای
        همکاری بین دفاتر املاک هست. 2نبش تلاش می‌کنه تا این شبکه همکاری رو بین
        مشاورین ایجاد کنه. فقط مشاورین املاکی رو که از کیفیت و سابقه خوبی
        برخوردار هستند به شبکه اضافه می‌کنه و با استفاده از ابزارهایی که در
        اختیار داره، فضای مطمئنی رو برای همکاری ایجاد می‌کنه یکی از بزرگترین
        چالش‌های بازار املاک در ایران، عدم وجود فضای قابل اطمینان برای همکاری
        بین دفاتر املاک هست. 2نبش تلاش می‌کنه تا این شبکه همکاری رو بین مشاورین
        ایجاد کنه. فقط مشاورین املاکی رو که از کیفیت و سابقه خوبی برخوردار هستند
        به شبکه اضافه می‌کنه و با استفاده از ابزارهایی که در اختیار داره، فضای
        مطمئنی رو برای همکاری ایجاد می‌کنه یکی از بزرگترین چالش‌های بازار املاک
        در ایران، عدم وجود فضای قابل اطمینان برای همکاری بین دفاتر املاک هست.
        2نبش تلاش می‌کنه تا این شبکه همکاری رو بین مشاورین ایجاد کنه. فقط
        مشاورین املاکی رو که از کیفیت و سابقه خوبی برخوردار هستند به شبکه اضافه
        می‌کنه و با استفاده از ابزارهایی که در اختیار داره، فضای مطمئنی رو برای
        همکاری ایجاد می‌کنه
      </div>

      <Title text="24 ساعته" />
      <div>
        سامانه مدیریت دفاتر املاک 2نبش، بعنوان نیروی کاری 24 ساعته برای شما کار
        می‌کنه. این سامانه خدماتی رو در اختیار شما قرار میده که کارایی دفتر
        املاک و توانایی مدیریتی شما رو چندین برابر می‌کنه. سامانه مدیریت دفاتر
        املاک 2نبش، بعنوان نیروی کاری 24 ساعته برای شما کار می‌کنه. این سامانه
        خدماتی رو در اختیار شما قرار میده که کارایی دفتر املاک و توانایی مدیریتی
        شما رو چندین برابر می‌کنه. سامانه مدیریت دفاتر املاک 2نبش، بعنوان نیروی
        کاری 24 ساعته برای شما کار می‌کنه. این سامانه خدماتی رو در اختیار شما
        قرار میده که کارایی دفتر املاک و توانایی مدیریتی شما رو چندین برابر
        می‌کنه.
      </div>
      <Title text="برندینگ و شناخته‌شدن" />
      <div>
        در حال حاضر سایت‌های آگهی عمومی، زنگ‌خور خوبی برای مشاورین ایجاد کردند و
        شرکت‌های فایل هم به خوبی فایل‌های مالک رو در اختیار مشاورین قرار میدن،
        اما هیچکدوم در معرفی مشاور و شناخته‌شدن دفتر املاک فعالیتی انجام نمیدن.
        شناخته‌شدن مشاور در منطقه، یکی از مهم‌ترین ابزارها برای داشتن مشتریان با
        کیفیت هست و 2نبش صفر تا 100 این حوزه رو برای دفاتر املاک انجام میده. در
        حال حاضر سایت‌های آگهی عمومی، زنگ‌خور خوبی برای مشاورین ایجاد کردند و
        شرکت‌های فایل هم به خوبی فایل‌های مالک رو در اختیار مشاورین قرار میدن،
        اما هیچکدوم در معرفی مشاور و شناخته‌شدن دفتر املاک فعالیتی انجام نمیدن.
        شناخته‌شدن مشاور در منطقه، یکی از مهم‌ترین ابزارها برای داشتن مشتریان با
        کیفیت هست و 2نبش صفر تا 100 این حوزه رو برای دفاتر املاک انجام میده.
      </div>
      <Features features={data.features} />
    </div>
  );
}
export async function getStaticProps() {
  const featuresResponse = await fetch("http://localhost:4001/Features");
  const featuresData = await featuresResponse.json();

  return {
    props: {
      data: {
        features: featuresData,
      },
    },
  };
}
