export default function CooperationNetwork() {
  return (
    <section className="bg-indigo-950 text-slate-50 text-center p-12">
      <h2 className="font-bold text-2xl py-5">شبکه همکاری فروش املاک</h2>
      <p className="text-lg leading-10">
        یکی از بزرگترین چالش‌های بازار املاک در ایران، عدم وجود فضای قابل
        اطمینان برای همکاری بین دفاتر املاک هست. 2نبش تلاش می‌کنه تا این شبکه
        همکاری رو بین مشاورین ایجاد کنه. فقط مشاورین املاکی رو که از کیفیت و
        سابقه خوبی برخوردار هستند به شبکه اضافه می‌کنه و با استفاده از ابزارهایی
        که در اختیار داره، فضای مطمئنی رو برای همکاری ایجاد می‌کنه
      </p>
    </section>
  );
}
